{
  "backend/main.mo": "Main actor implementing an e-commerce backend with product management, user profiles, shopping baskets, categories, price constraints, Stripe integration, store settings, and role-based access control using mixins for storage and authorization.",
  "backend/migration.mo": "Migration module defining type aliases for all data structures (Product, Category, Basket, StoreSettings, etc.) and a run function that currently performs no-op migration by returning the old actor state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features related to product fetching, rendering, cache invalidation, and logging in the useProducts hook, ProductGrid, and uploader components.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend components, pages, hooks, and configuration files describing the marketplace UI, admin dashboard, cart functionality, and styling system.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color tokens for light and dark themes, including warm earthy tones for background, foreground, primary, secondary, and UI component colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Product Marketplace' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component using TanStack Router to define routes for marketplace, admin, cart, payment success/failure pages with a shared layout containing Header and Footer components.",
  "frontend/src/components/AdminManager.tsx": "Admin management component with UI for adding/removing administrators by principal ID, displaying current admins in a table, with validation, confirmation dialogs, and protection against self-removal.",
  "frontend/src/components/BatchUploader.tsx": "Component for batch uploading multiple products with images, names, and prices to a selected category. Validates price constraints, handles file uploads with progress tracking, and manages upload status for each product.",
  "frontend/src/components/CategoryFilter.tsx": "Collapsible category filter component that displays parent categories and subcategories with checkboxes. Supports hierarchical selection where selecting a parent selects all its subcategories.",
  "frontend/src/components/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/CategorySelector.tsx": "Dropdown selector for categories with admin functionality to create, edit, and delete categories including parent-child relationships. Displays price constraints for selected categories and handles error messages for unauthorized actions.",
  "frontend/src/components/Footer.tsx": "Footer component displaying About, Connect (social media links), and Support sections. Includes branding with caffeine.ai attribution and copyright notice.",
  "frontend/src/components/Header.tsx": "Sticky header navigation with logo, Shop/Admin links, and shopping cart button showing item count badge. Uses TanStack Router for navigation.",
  "frontend/src/components/ProductCard.tsx": "Product display card with image, details, and purchase options (Buy Now/Add to Cart). Includes admin functionality to update product images with upload progress tracking and Stripe checkout integration.",
  "frontend/src/components/ProductGrid.tsx": "Displays a grid of product cards with category filtering support, including hierarchical category filtering (parent and subcategories). Contains extensive console logging for debugging product rendering and filtering behavior.",
  "frontend/src/components/SettingsForm.tsx": "Form component for configuring store settings including store name, description, contact email, currency selection, and tax rate with validation. Uses React Query hooks for fetching and updating settings with toast notifications.",
  "frontend/src/components/SingleProductUploader.tsx": "Form component for uploading individual products with image upload, name, price, and category selection. Validates price against category-specific minimum price constraints and handles image file conversion to ExternalBlob with upload progress tracking.",
  "frontend/src/components/StripeConfigForm.tsx": "Configuration form for Stripe payment integration allowing users to set secret key and allowed countries. Displays configuration status and uses React Query for checking and updating Stripe settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state. Automatically creates authenticated or anonymous actors and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminManagement.ts": "Provides React Query hooks for managing admin users including fetching admin list, adding admins, and removing admins with automatic cache invalidation.",
  "frontend/src/hooks/useCart.ts": "Custom hook for shopping cart functionality providing queries and mutations for basket operations (add, remove, clear items) with automatic item count calculation and loading states.",
  "frontend/src/hooks/useCheckout.ts": "Provides a mutation hook for creating Stripe checkout sessions with shopping items, generating success and cancel URLs based on current window location.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePriceConstraints.ts": "Custom hook that fetches price constraints for a given category using React Query and the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for categories and products CRUD operations, including fetching, adding, updating, and deleting with detailed logging and error handling.",
  "frontend/src/hooks/useSettings.ts": "Custom hooks for querying and updating store settings using React Query with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm, earthy color palette (terracotta, sage, cream) defined using CSS variables for both light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard with tabbed interface for managing products (single/batch upload), payment configuration, store settings, and admin users.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with product details, quantities, prices, and checkout functionality with Stripe integration.",
  "frontend/src/pages/MarketplacePage.tsx": "Main marketplace page with category filtering sidebar and product grid displaying handcrafted artisan products.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation page displaying failure message with options to return to cart or continue shopping.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that displays a confirmation message with a checkmark icon and clears the shopping cart on mount, providing a button to return to the home page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (terracotta, sage, cream), typography with Inter and Playfair Display fonts, and extended theme settings including animations and container queries.",
  "project_state.json": "Project state document describing a marketplace application with batch image upload, category management, Stripe payment integration, and shopping cart functionality, with known issues around image upload and product display."
}