{
  "backend/main.mo": "Main backend actor implementing an e-commerce platform with product management, category hierarchy, user profiles, shopping baskets, Stripe integration, access control, blob storage, and price constraints; includes migration support and admin-only operations.",
  "backend/migration.mo": "Migration module that ensures the '3d print' category has a 'shape type' subcategory during canister upgrades by checking and adding it if missing.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend components, pages, hooks, and configuration files describing the marketplace UI, admin dashboard, category management, product display, cart functionality, and Stripe integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining colors for backgrounds, foregrounds, cards, buttons, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and module script loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component defining TanStack Router with routes for marketplace, admin, cart, payment success/failure pages, all wrapped in a layout with header and footer.",
  "frontend/src/components/AdminManager.tsx": "Admin management component with UI for adding/removing administrators by principal ID, displaying current admins in a table, with confirmation dialogs and toast notifications for actions.",
  "frontend/src/components/BatchUploader.tsx": "Batch product upload component with category selection, image file handling, price validation against category constraints, progress tracking, and sequential upload workflow using start/upload/finish mutations.",
  "frontend/src/components/CategoryFilter.tsx": "A collapsible category filter component that displays hierarchical categories with checkboxes, supporting parent-child relationships and allowing users to filter products by selecting multiple categories.",
  "frontend/src/components/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/CategorySelector.tsx": "A category selector dropdown with CRUD operations (create, edit, delete) for managing categories, including parent-child relationships, price constraint display, and comprehensive error handling for admin operations.",
  "frontend/src/components/Footer.tsx": "A footer component displaying social media links, about/contact information, and a Caffeine.ai attribution with dynamic UTM tracking.",
  "frontend/src/components/Header.tsx": "A sticky header navigation bar with logo, shop/admin links, and a shopping cart button that displays the current item count badge.",
  "frontend/src/components/ProductCard.tsx": "A product card component displaying product image, name, price, category, and description with 'Buy Now' and 'Add to Cart' buttons that integrate with Stripe checkout and shopping cart functionality.",
  "frontend/src/components/ProductGrid.tsx": "A responsive grid layout component that displays filtered products based on selected categories, including support for hierarchical category filtering and loading/empty states.",
  "frontend/src/components/SettingsForm.tsx": "A settings form component for configuring store information (name, description, contact email), currency selection, and tax rate with validation and persistence using React Query mutations.",
  "frontend/src/components/SingleProductUploader.tsx": "React component for uploading individual products with name, price, category, and image; validates price constraints per category and displays upload progress.",
  "frontend/src/components/StripeConfigForm.tsx": "React component for configuring Stripe payment settings including secret key and allowed countries; displays configuration status and allows updates.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with Internet Identity authentication; automatically invalidates and refetches dependent queries when actor changes.",
  "frontend/src/hooks/useAdminManagement.ts": "Custom hooks for managing admin users: fetching admin list, adding admins, and removing admins using React Query mutations.",
  "frontend/src/hooks/useCart.ts": "Custom hook for shopping cart operations including fetching basket items, adding/removing items, clearing basket, and calculating item count.",
  "frontend/src/hooks/useCheckout.ts": "Custom hook that creates Stripe checkout sessions with success/cancel URLs and returns the session ID and redirect URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/usePriceConstraints.ts": "Custom hook that fetches price constraints for a specific product category from the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Custom hooks for category and product CRUD operations with extensive logging; includes fetching categories, adding categories with parent normalization, and managing products.",
  "frontend/src/hooks/useSettings.ts": "Custom hooks for fetching and updating store settings using React Query with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm, earthy color palette (terracotta, sage, cream) using OKLCH color space, including light/dark mode themes and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed interface for managing products (single/batch upload), Stripe payment configuration, general settings, and admin user management.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with product details, quantities, prices, and checkout functionality using Stripe integration.",
  "frontend/src/pages/MarketplacePage.tsx": "Main marketplace page with category filtering sidebar and product grid displaying handcrafted artisan products.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation confirmation page with options to return to cart or continue shopping.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that clears the shopping cart and provides navigation back to marketplace.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both hash-based and browser-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors (OKLCH-based), typography, container queries, animations, and design tokens for the application's warm earthy aesthetic.",
  "project_state.json": "Project state file tracking a marketplace application with batch image upload, category management, Stripe payment integration, and shopping cart functionality. Contains architectural notes, existing features, known issues, and project metadata at version 33."
}