{
  "backend/main.mo": "Main backend actor implementing an e-commerce platform with user profiles, products, categories, shopping baskets, Stripe integration, blob storage for images, and role-based access control (admin/user permissions).",
  "backend/migration.mo": "Migration module defining type aliases for all data structures (Currency, StoreSettings, Category, Product, etc.) and a pass-through migration function that preserves existing actor state.",
  "feature_evidence.json": "Feature evidence report documenting image upload debugging tasks for BatchUploader and SingleProductUploader components, plus image editing functionality for product management interfaces.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, marketplace pages, admin dashboard, category management, product upload components, cart functionality, and styling configuration.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes with neutral grayscale palette and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Product Marketplace application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for marketplace, admin, cart, payment success/failure pages, all wrapped in a layout with Header and Footer.",
  "frontend/src/components/AdminManager.tsx": "Admin management interface component allowing admins to add/remove other administrators by principal ID, with validation, confirmation dialogs, and current user protection.",
  "frontend/src/components/BatchUploader.tsx": "Component for batch uploading multiple products with images, names, and prices to a selected category. Validates price constraints, handles file uploads with progress tracking, and manages upload state for each product.",
  "frontend/src/components/CategoryFilter.tsx": "Collapsible category filter component that displays parent categories and subcategories with checkboxes. Supports hierarchical selection where selecting a parent includes all its subcategories.",
  "frontend/src/components/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/CategorySelector.tsx": "Dropdown selector for categories with admin functionality to create, edit, and delete categories. Displays price constraints for selected categories and handles parent-child category relationships.",
  "frontend/src/components/Footer.tsx": "Footer component displaying about section, social media links, support contact, and attribution to caffeine.ai with dynamic UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation to Shop, Admin, and Cart pages, displaying cart item count badge and Artisan Market branding.",
  "frontend/src/components/ProductCard.tsx": "Product display card with buy now and add-to-cart functionality, plus admin-only image editing capability. Handles Stripe checkout session creation and image upload with progress tracking.",
  "frontend/src/components/ProductGrid.tsx": "Grid layout component that displays filtered products based on selected categories, including hierarchical category filtering with parent-child relationships.",
  "frontend/src/components/SettingsForm.tsx": "React component for managing store settings including name, description, contact email, currency selection, and tax rate configuration with validation and persistence via React Query mutations.",
  "frontend/src/components/SingleProductUploader.tsx": "React component for uploading individual products with image selection, price validation against category constraints, and progress tracking for image uploads using ExternalBlob.",
  "frontend/src/components/StripeConfigForm.tsx": "React component for configuring Stripe payment settings including secret key and allowed countries, with status checking and configuration persistence.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminManagement.ts": "Custom React hooks for managing admin users including fetching admin list, adding admins, and removing admins using React Query mutations.",
  "frontend/src/hooks/useCart.ts": "Custom React hook providing shopping cart functionality including fetching basket items, adding/removing items, clearing basket, and tracking item count.",
  "frontend/src/hooks/useCheckout.ts": "Custom React hook for creating Stripe checkout sessions with shopping items and success/cancel URLs, parsing the returned session data.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/usePriceConstraints.ts": "Custom React hook for fetching price constraints for a specific product category from the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching categories and products, adding/updating/deleting categories and products, with extensive logging for debugging category creation and parent relationships.",
  "frontend/src/hooks/useSettings.ts": "Exports React Query hooks for fetching and updating store settings using the actor from useActor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a warm, earthy color palette (terracotta, sage, cream) using OKLCH color space, supporting both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard with tabs for adding single products, batch uploading, configuring Stripe payment, managing store settings, and managing admin users.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with product details, quantities, and prices, with functionality to remove items and proceed to Stripe checkout.",
  "frontend/src/pages/MarketplacePage.tsx": "Main marketplace page with a category filter sidebar and product grid, allowing users to browse and filter handcrafted products.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation page displaying a failure message with options to return to cart or continue shopping.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that clears the shopping cart and displays a confirmation message with option to continue shopping.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space (including terracotta, sage, cream theme colors), typography settings with Inter and Playfair Display fonts, container queries, animations, and sidebar component styling.",
  "project_state.json": "Project state document tracking a marketplace application with batch image upload, category management, Stripe payment integration, shopping cart, and admin panel; currently has a known issue where image upload is not functional."
}