{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix product visibility in marketplace after upload",
  "requirements": [
    {
      "id": "REQ-82",
      "summary": "Verify the useProducts React Query hook correctly fetches and caches all products without client-side filtering",
      "acceptanceCriteria": [
        "useProducts hook successfully fetches complete product list",
        "No client-side filtering removes products from the displayed list",
        "Query cache properly invalidates after product creation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add comprehensive logging to the useProducts hook to track: 1) when the query is triggered, 2) the raw response from actor.getAllProducts(), 3) the number of products returned, 4) product IDs in the response. Verify that no filtering logic exists in the queryFn that would exclude products. Ensure the query is enabled when actor is available and not fetching."
        }
      ]
    },
    {
      "id": "REQ-83",
      "summary": "Ensure ProductGrid component renders all products without applying hidden filters that exclude certain products",
      "acceptanceCriteria": [
        "ProductGrid displays every product in the products array",
        "No conditional rendering logic hides products unexpectedly",
        "Empty states display correctly when no products exist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductGrid.tsx",
          "operation": "modify",
          "description": "Add logging to track: 1) the full products array passed to ProductGrid, 2) the filtered products array after category filtering, 3) any products that are excluded by filtering logic. Review the category filtering logic to ensure it doesn't inadvertently hide products with valid category IDs. Verify that products with no matching category are handled appropriately (either shown in an 'Uncategorized' section or explicitly filtered with logging)."
        }
      ]
    },
    {
      "id": "REQ-84",
      "summary": "Verify that SingleProductUploader and BatchUploader properly invalidate products cache after successful upload",
      "acceptanceCriteria": [
        "Products query cache is invalidated after successful single product upload",
        "Products query cache is invalidated after successful batch upload",
        "Marketplace page automatically refetches and displays new products"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SingleProductUploader.tsx",
          "operation": "modify",
          "description": "Add logging immediately after successful product upload and after cache invalidation. Log: 1) 'Product uploaded successfully', 2) the product details, 3) 'Invalidating products query cache'. Verify that queryClient.invalidateQueries({ queryKey: ['products'] }) is called after the upload mutation succeeds. Add a small delay (100ms) after invalidation to allow the refetch to complete before showing success message."
        },
        {
          "path": "frontend/src/components/BatchUploader.tsx",
          "operation": "modify",
          "description": "Add logging after successful batch upload completion and after cache invalidation. Log: 1) 'Batch upload completed', 2) the number of products uploaded, 3) 'Invalidating products query cache'. Verify that queryClient.invalidateQueries({ queryKey: ['products'] }) is called after finishBatchUpload succeeds. Ensure the invalidation happens after the final backend call that completes the batch."
        }
      ]
    },
    {
      "id": "REQ-85",
      "summary": "Add comprehensive logging in the product retrieval flow to track when products appear in frontend queries",
      "acceptanceCriteria": [
        "Frontend logs product fetch responses with count and IDs",
        "Cache invalidation events are logged with timestamps"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Enhance the useProducts hook with detailed logging: 1) Log when the query starts fetching with timestamp, 2) Log the raw response from getAllProducts() including product count and all product IDs, 3) Log any errors with full error details, 4) Add logging to the onSuccess callback if present. Use console.log with '[useProducts]' prefix for easy filtering in browser console."
        },
        {
          "path": "frontend/src/components/SingleProductUploader.tsx",
          "operation": "modify",
          "description": "Add timestamp logging for cache invalidation events. Log: 1) timestamp when invalidation is triggered, 2) 'Cache invalidated at [timestamp]', 3) 'Waiting for refetch...'. This helps track the timing between upload completion and UI refresh."
        },
        {
          "path": "frontend/src/components/BatchUploader.tsx",
          "operation": "modify",
          "description": "Add timestamp logging for batch upload completion and cache invalidation. Log: 1) timestamp when batch finishes, 2) 'Batch complete at [timestamp]', 3) 'Cache invalidated at [timestamp]'. Include the total elapsed time for the batch operation."
        },
        {
          "path": "frontend/src/components/ProductGrid.tsx",
          "operation": "modify",
          "description": "Add logging at the component level to track re-renders and product updates. Log: 1) 'ProductGrid rendering with X products' on each render, 2) 'Products changed' when the products array reference changes, 3) 'Filtered to Y products' after category filtering. Use React.useEffect to detect changes in the products array."
        }
      ]
    }
  ]
}